ADNdlc/STM32_CubeIDE/H743/0-8_example_project_v2/BSP/BSP_init.c
/*
 * BSP_init.c
 *
 *  Created on: Feb 7, 2026
 *      Author: 12114
 */
#include "Project_cfg.h"
#if (TARGET_PLATFORM == PLATFORM_STM32)
#include "stm32_mem.h"
#define platform_sys_mem_create() stm32_sys_mem_create()
#endif // TARGET_PLATFORM
#include "MemPool.h"
#include "Sys.h"
#include "dev_map.h"
#include "elog_init.h"
#include "uart_queue/uart_queue.h"
#include "usart_hal/usart_hal.h"


/* 全局设备句柄 */
usart_hal_t *g_debug_uart = NULL;
uart_queue_t *g_debug_queue = NULL;

/* 调试串口队列用的缓冲区 */
static uint8_t debug_tx_buf[4096];
static uint8_t debug_rx_buf[64];

void bsp_init(void) {
#ifndef platform_sys_mem_create
#error "bsp_init: 未定义有效的目标平台，请检查TARGET_PLATFORM配置"
#endif
  SysMem *mem_temp = NULL;
  mem_temp = platform_sys_mem_create();
  sys_mem_init(mem_temp); // 内存池功能初始化
                          /* 系统初始化 */
  sys_init();
  sys_mem_init_internal();

  /* 1. 创建硬件抽象层串口对象 */
  g_debug_uart = usart_hal_create(usart_driver_get(USART_ID_DEBUG));

  /* 2. 创建并初始化全局队列 */
  if (g_debug_uart) {
    g_debug_queue =
        uart_queue_create(g_debug_uart, debug_tx_buf, sizeof(debug_tx_buf),
                          debug_rx_buf, sizeof(debug_rx_buf));
    if (g_debug_queue) {
      uart_queue_set_wait_config(g_debug_queue, 2, 50); // 2ms等待, 最多50次
      uart_queue_set_auto_wait(g_debug_queue, true);
      uart_queue_start_receive(g_debug_queue); // 开启异步接收
    }
  }

  /* 3. elog初始化 */
  if (elog_init_and_config() == ELOG_NO_ERR) {
    // elog_init_and_config 内部会调用 elog_port_init，届时将在 elog_port.c
    // 中接入 g_debug_queue
  } else {
    elog_deinit();
  }
}
